examples/porousHeatTransferFoam/PCMValidations/multiLayer/GR41-GR27-charge/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    floor
    {
        type            fixedValue;
        value           uniform (0 
				#eval "10. * 1.85e-5 / 1.16 / 2.0e-3" 
				0);
    }

    ceiling
    {
	    type         fluxCorrectedVelocity;
    }
	
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
