examples/porousHeatTransferFoam/PCMValidations/multiLayer/GR41-GR27-charge/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "rho.*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       0;
        relTol          0;
    }

    p
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-10;
        relTol          0.001;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    "(U|h.fluid|e.fluid|)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-9;
        relTol          0.001;
    }

    "(U|h.fluid|e.fluid|)Final"
    {
        $U;
        tolerance       1e-12;
        relTol          0;
    }
	
	T.solid
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-09;
        relTol          0.001;
    }
	
	T.solidFinal
    {
        $p;
        relTol          0;
    }

}

PIMPLE
{
    momentumPredictor no;
    nOuterCorrectors 10;
    nCorrectors     1;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       1e5;
    SIMPLErho       yes;
	
	residualControl
    {
    /*    U
        {
                tolerance  1e-5;
                relTol      0;
        }*/
        p
        {
                tolerance  1e-4;
                relTol      0;
        }
		"T.solid"
        {
                tolerance  1e-5;
                relTol      0;
        }
     }
}

relaxationFactors
{
	/**/fields
    {
        p      0.9;
        pFinal   1;
    }
	
    equations
    {
		"(U|h.fluid|e.fluid|T.solid)Final"            1;
	//	U            0.9;
		h.fluid			0.6;
		T.solid			0.7;
    }
}

// ************************************************************************* //
